//
// Created by steve on 18-8-16.
//

#include <stdio.h>
#include <string.h>

int main() {
    int D, I;
    while (scanf("%d%d", &D, &I) == 2) {
        int k = 1;//当前结点编号
        /**
         * 对于每个结点的小球，如果是奇数编号，则往左子树走，否则往右子树走
         *
         * 对于落入根节点左子树的小球来说，只需知道该小球是第几个落在根的左子树里的，就可以知道它下一步是往左还是往右
         * 如果使用题目中给出的编号I，则当I是奇数时，它是往左走的第（I+1）/2个小球
         * 当它是偶数时，它是往右走的第I/2个小球
         */
        for (int i = 0; i < D - 1; ++i) {
            //每个小球下落D-1次到达底层
            if (I % 2) {
                //往左走
                k = k * 2;
                I = (I + 1) / 2;
            }
            else {
                //往右走
                k = k * 2 + 1;
                I = I / 2;
            }
        }
    }
    return 0;
}